{
    "version": "https://jsonfeed.org/version/1",
    "title": "Blog",
    "home_page_url": "",
    "feed_url": "https://drum.zone/feed.json",
    "description": "Hot takes from another white guy.",
    "icon": "https://drum.zone/assets/images/icon-512.png",
    "favicon": "https://drum.zone/favicon.ico",
    "expired": false,
    "items": [
    
      
        
        
        {
            "id": "https://drum.zone/book/2021/01/24/the-courage-to-be-disliked/",
            "title": "The Courage To Be Disliked",
            "content_text": "Forward: As part of my year of intention I’ve decided to do ‘book reports’ on any books I read. They will serve both as an overview of the contents to help it stick in my brain, as well as my own reactions to the views posed by the book. So here we go!\n\n\n\nThe Courage to be Disliked by Fumitake Koga and Ichiro Kishimi is a book on Individual psychology as founded by Alfred Adler, which takes the form of a dialogue between a wise elder and a young contrarian determined to prove him wrong about his views on the world. I wasn’t familiar with this form of psychology before going into this, which made it a fascinating, disruptive read. It was suggested to me by my Psychiatrist, for reasons I have yet to confront him about, but I now have a deep curiosity about. It is (as I learned) a rejection of classical Freudian “Etiological” psychology, that all of our behaviors have causes, instead advocating for Teleology: that our behaviors are formed to serve an end goal. In other words: it’s a book about finding happiness not by looking backwards, but forwards.\n\nThe core ideas I took out of the book are as follows:\n\n  The world is actually pretty simple. We’re the ones inventing all the problems for ourselves. People are not shaped by their past, and can change and be happy right now.\n  All problems are interpersonal relationship problems. We measure ourselves against others, and avoid life’s hardships by foisting our responsibilities on those above or below us, rather than seeking relationships of camaraderie.\n  Living a meaningful life is ultimately about courage: the courage to happy, the courage to be disliked, and (weirdly) the courage to be normal.\n\n\nTrauma does not exist\nThe book starts with one of the hardest ideas to accept right out of the gate: that the past does not determine the future. According to Adler, trauma does not exist, and is in fact a dangerous idea that we use as an excuse not to change. No experience is the sole cause of our current behavior; rather, we use those experiences as a tool for whatever suits our purposes. It is much safer to believe that our unhappiness is not our fault, and that there’s nothing that can be done about it. This is one of several supposed life lies laid out in the book. We should instead recognize that the meaning we give these traumas is self-determining, and that we should instead recognize that, with courage, we can reject the hold of the past and decide how we wish to live.\n\nChange is scary, there’s no doubt about that. More often than not, we will continue down the safety of the known path without risk over the unknown road, even if we can clearly see the benefits of changing our direction. We may find ourselves miserable where we are in life and desperate for change, but the book actually goes so far as to state that this way of life is an intentional choice that each person is making to remain where they are, for it suits some purpose. We create the fear ourselves to meet the goal of getting attention, making our lives easier, or whatever else the people around us are doing to accommodate our current behavior. With nothing more than courage, we can change right now, and be happy.\n\nNow for my take: I can see that this framework is itself a very powerful tool for self-improvement. Our focus determines our reality, and I’ve seen firsthand that unshackling myself from certain assumptions about my past or my character can have drastic effect on my overall life1. On the whole though, I cannot accept the foundations that it rests upon, that determinism is a lie. On its own, this proposed theory is pretty internally consistent, especially with the remainder of the lessons in the book, which is probably why they start with this idea first. This idea, though, ultimately suggests that the internal dialogue that narrates our lives is really all there is, which is pretty radical2.\n\nWhatever the underlying ideas, there’s definitely something to this. The book runs through several examples of people “choosing” to get angry with a person, or “wanting” to remain a shut-in, which rubbed me the wrong way, but after a while I decided to interpret that language as simply a way of explaining the behaviors of the subconscious/emotional core. People aren’t consciously thinking that they wanted to stay in a job that they hated, but they do it anyway, and this is one way of interpreting that. More importantly though, it’s an excellent way of bridging the gap between to your subconscious, and doing some good good introspection. If you can identify some hidden feelings or irrational beliefs that are keeping you from making the changes you’d really like to, the more power you will have to correct them. Ultimately, I do believe that people can change.\n\nDo not seek recognition, do not praise others\n\nThe book goes on to assert several related ideas about interpersonal relationships, which Adler considers to be the only source of our problems. It points out that we often dislike ourselves due to a feeling of inferiority, but that this is completely subjective. It is living by other people’s standards instead of our own. Similarly, when we seek recognition from others, we are resigning our happiness to the whims of others. This is often the reason we give ourselves to avoid change, and fail to find happiness. Life is not a competition. When we view others as our enemies, and we see life as a zero-sum game, we are falling into the trap of living by other people’s standards, rather than being true to ourselves. True happiness can only be gained by living up to our own values, not those of others.\n\nWhen we seek recognition from people, we are granting them a position of authority over us. When we praise others, we are also implicitly placing ourselves above them. This is the foundation of a vertical relationship, and it’s one Adler wholeheartedly rejects. If we live in a world of vertical relationships, it is a world where we do not see each other as equals, each with their own responsibilities and freedom. Here’s a profound observation the book makes: if someone close to you, a friend or family member, gives you help, you show gratitude. You’d sound like a psychopath if you were to give them praise, saying “good job” when they helped you move. Yet in a workplace, such a thing is commonplace. Adler suggests that we should seek only horizontal relationships, in which there is no condemnation or praise, merely gratitude. This even extends to a parent-child relationship, which gets interesting.\n\nA horizontal relationship is achieved, the book says, by focusing only on our own tasks, and leaving others to theirs. If you’re not the one who would receive the results of a task, it’s not yours to worry about. We don’t expect a parent to do their kid’s homework, so why do we then blame a parent for not intervening when a child is getting into drugs or dropping out of school? We all see the reasons for the former: children need to learn responsibility, and would fall behind in their studies or continue to rely on their parents to do what is ultimately their own task. It’s when the consequences are more dire that we lose sight of this. Conversely, a parent who does intervene in a child’s life is often done with the message that “it’s for your own good”. The book claims this is a lie, and that the parents are really just trying to fulfill their own goals… which is to be accepted in the eyes of the community, or to impose those ideals onto their children. It all comes back to the observation that we are choosing to live up to the standards of others. We should instead recognize our freedom to measure our own lives and find our own happiness3, and, crucially, to grant others that same freedom.\n\nThis all pretty much blew my mind. The instinct to seek recognition and praise from others feels completely natural, and receiving it perfectly healthy and desirable, but this was very clearly showing that not to be true. The harder thing for me, though, was reading about the other half: that inserting myself in other people’s tasks was not only an invalidation of their freedom, but a selfish maneuver as well. I’ve definitely struggled in the past for feeling a deep responsibility for the misfortunes of some of the people I’m closest to in life, and then trying to fix things for them. Why should they suffer when I know that I can jump in and help them? To be sure, there is nothing wrong with feeling concern for others offering help. We are meant to guide others to water, but it is still their responsibility to drink. People need to feel autonomy in their own lives4, not that things are out of their control. If we grab the controls away from other people, we are robbing them the chance of finding to their own happiness.\n\nThe cost of freedom is the courage to be disliked\n\nFreedom. Finding your own happiness. Sounds great and all. Um, quick question, how though?\n\nThe book eventually gets around to defining happiness as “the feeling of contribution”. When one has realized that they are in control of their own lives, and have found a community of comrades5 rather than competitors, they can achieve this feeling by seeing that they are of use to others. If we can break out of the habit of self-centeredness, it will shift naturally to concern for others. “But wait! I thought this whole thing was saying to be concerned with my own problems!” Indeed! Here’s how he somersaults through that one: the problems that you’re probably thinking about are still all self-centered. Our life struggle should in fact be to find our places in our various communities, and be of use to others. It’s not about making a certain amount of money, or being liked by other people, or feeling like a super special flower that’s worthy of praise. It’s about knowing that your life has meaning, and only you can measure that. When you feel like you’ve contributed to the lives of others or the environment around you, you don’t feel the need for recognition nor the fear of dislike. You just feel happy.\n\nSo all of this builds up to the title of the book, which was never stated much less explained until quite a ways into the book. “Adlerian psychology is about courage”, the wise old man says, days into his conversation with the fictional young man who’s doomed to be convinced.\n\nThe courage to be happy: it’s on us to face the world as it is. It’s truly, deeply scary to realize that we’re in charge of the one life we get to live. We cannot use our past, our relationships, or our environment as an excuse for why things can’t change. What you’re born with is out of your control, but everything after that is your dance to dance. So find your place on the dance floor, and have a little fun with it.\n\nThe courage to be disliked: it’s on us to accept that we can’t control what other people do or what they think about us. It’s truly, deeply scary to risk displeasing people that support us. We must put our confidence in others to exercise their own freedom, and in so doing we achieve freedom ourselves.\n\nThe courage to be normal: it’s on us to just be us. It’s truly, deeply scary to face the idea that this may be our last day. Life cannot be something we live en route to some idealized destination that will give us fulfillment. Self-acceptance means loving every moment of your life. When we find our place in our communities and are of use to those around us, it becomes clear that we have existential worth. All we have to be is ourselves, and we will already fulfilled our purpose in life.\n\nLife is a dance to be lived in here and now. This metaphor is hammered home in the last chapters of the book, and as a definitive Bad Dancer it really brought some of that visceral fear of making a fool out of myself in front of everyone. Of not knowing what I was doing, of being exposed as a fraud or a fool. So, even in that, I profoundly agree with the book that life is about finding courage. The courage to dance as if no one is watching.\n\n\n  \n    \n      Until last year, I believed I was on the autism spectrum due to some really screwed up diagnoses as a child. Imagine how that would shape your life! &#8617;\n    \n    \n      From a philosophical perspective, yes, technically all we can know is that we exist. I think therefore I am, all that stuff. I’m pretty sold on the whole science thing though, and the idea that the world we seem to be observing is some interpretation of an objective reality that is shared by other beings that also have that whole consciousness thing going on. We can explain the behavior of biological creatures though layers of scientific knowledge based on evolutionary biology, and that’s the framework I’m going with for now. Maybe I’m just scared of change? &#8617;\n    \n    \n      Okay so what, we should just be selfish and only worry about ourselves, and ignore the suffering all around us as long as we are happy? That would be quite the hot take, and is where my skepticism took me on my first read as well. Suffice it to say no, that’s not at all where this is going. &#8617;\n    \n    \n      An ex tried to teach me this once. She was a social worker, and had long ago learned the lessons of the appropriate ways to help other people. Ultimately our relationship ended, in part, because I hadn’t figured this out for myself yet. Reading this book brought a lot of wisdom that I wish I’d had then, but I also doubt that without those experiences I could have internalized it quite as well. &#8617;\n    \n    \n      Yeah so the whole communist thing is probably a real influence on all this. Haven’t actually checked on this myself, and I don’t really want to, for fear of irrevocably tying it to the muddy waters of politics. The themes of rejection of the hierarchy certainly ring true of Marxism. On the other hand the book is still quite individualistic, saying we should not take responsibility for fixing the lives of others, which is like, not very socialist? &#8617;\n    \n  \n\n",
            "content_html": "<p><em>Forward: As part of my <a href=\"/personal/2021/01/02/year-of-intention/\">year of intention</a> I’ve decided to do ‘book reports’ on any books I read. They will serve both as an overview of the contents to help it stick in my brain, as well as my own reactions to the views posed by the book. So here we go!</em></p>\n\n<hr />\n\n<p><strong>The Courage to be Disliked</strong> by Fumitake Koga and Ichiro Kishimi is a book on <a href=\"https://en.wikipedia.org/wiki/Individual_psychology\">Individual psychology</a> as founded by Alfred Adler, which takes the form of a dialogue between a wise elder and a young contrarian determined to prove him wrong about his views on the world. I wasn’t familiar with this form of psychology before going into this, which made it a fascinating, disruptive read. It was suggested to me by my Psychiatrist, for reasons I have yet to confront him about, but I now have a deep curiosity about. It is (as I learned) a rejection of classical Freudian “Etiological” psychology, that all of our behaviors have causes, instead advocating for Teleology: that our behaviors are formed to serve an end goal. In other words: it’s a book about finding happiness not by looking backwards, but forwards.</p>\n\n<p>The core ideas I took out of the book are as follows:</p>\n<ol>\n  <li>The world is actually pretty simple. We’re the ones inventing all the problems for ourselves. People are not shaped by their past, and can change and be happy right now.</li>\n  <li>All problems are interpersonal relationship problems. We measure ourselves against others, and avoid life’s hardships by foisting our responsibilities on those above or below us, rather than seeking relationships of camaraderie.</li>\n  <li>Living a meaningful life is ultimately about courage: the courage to happy, the courage to be disliked, and (weirdly) the courage to be normal.</li>\n</ol>\n\n<h2 id=\"trauma-does-not-exist\">Trauma does not exist</h2>\n<p>The book starts with one of the hardest ideas to accept right out of the gate: that the past does not determine the future. According to Adler, trauma does not exist, and is in fact a dangerous idea that we use as an excuse not to change. No experience is the sole cause of our current behavior; rather, we use those experiences as a tool for whatever suits our purposes. It is much safer to believe that our unhappiness is not our fault, and that there’s nothing that can be done about it. This is one of several supposed life lies laid out in the book. We should instead recognize that the meaning we give these traumas is self-determining, and that we should instead recognize that, with courage, we can reject the hold of the past and decide how we wish to live.</p>\n\n<p>Change is scary, there’s no doubt about that. More often than not, we will continue down the safety of the known path without risk over the unknown road, even if we can clearly see the benefits of changing our direction. We may find ourselves miserable where we are in life and desperate for change, but the book actually goes so far as to state that this way of life is an intentional choice that each person is making to remain where they are, for it suits some purpose. We create the fear ourselves to meet the goal of getting attention, making our lives easier, or whatever else the people around us are doing to accommodate our current behavior. With nothing more than courage, we can change right now, and be happy.</p>\n\n<p>Now for my take: I can see that this framework is itself a very powerful tool for self-improvement. Our focus determines our reality, and I’ve seen firsthand that unshackling myself from certain assumptions about my past or my character can have drastic effect on my overall life<sup id=\"fnref:1\" role=\"doc-noteref\"><a href=\"#fn:1\" class=\"footnote\">1</a></sup>. On the whole though, I cannot accept the foundations that it rests upon, that determinism is a lie. On its own, this proposed theory is pretty internally consistent, especially with the remainder of the lessons in the book, which is probably why they start with this idea first. This idea, though, ultimately suggests that the internal dialogue that narrates our lives is really all there is, which is pretty radical<sup id=\"fnref:2\" role=\"doc-noteref\"><a href=\"#fn:2\" class=\"footnote\">2</a></sup>.</p>\n\n<p>Whatever the underlying ideas, there’s definitely something to this. The book runs through several examples of people “choosing” to get angry with a person, or “wanting” to remain a shut-in, which rubbed me the wrong way, but after a while I decided to interpret that language as simply a way of explaining the behaviors of the subconscious/emotional core. People aren’t consciously thinking that they wanted to stay in a job that they hated, but they do it anyway, and this is one way of interpreting that. More importantly though, it’s an excellent way of bridging the gap between to your subconscious, and doing some good good introspection. If you can identify some hidden feelings or irrational beliefs that are keeping you from making the changes you’d really like to, the more power you will have to correct them. Ultimately, I do believe that people can change.</p>\n\n<h2 id=\"do-not-seek-recognition-do-not-praise-others\">Do not seek recognition, do not praise others</h2>\n\n<p>The book goes on to assert several related ideas about interpersonal relationships, which Adler considers to be the only source of our problems. It points out that we often dislike ourselves due to a feeling of inferiority, but that this is completely subjective. It is living by other people’s standards instead of our own. Similarly, when we seek recognition from others, we are resigning our happiness to the whims of others. This is often the reason we give ourselves to avoid change, and fail to find happiness. Life is not a competition. When we view others as our enemies, and we see life as a zero-sum game, we are falling into the trap of living by other people’s standards, rather than being true to ourselves. True happiness can only be gained by living up to our own values, not those of others.</p>\n\n<p>When we seek recognition from people, we are granting them a position of authority over us. When we praise others, we are also implicitly placing ourselves above them. This is the foundation of a vertical relationship, and it’s one Adler wholeheartedly rejects. If we live in a world of vertical relationships, it is a world where we do not see each other as equals, each with their own responsibilities and freedom. Here’s a profound observation the book makes: if someone close to you, a friend or family member, gives you help, you show gratitude. You’d sound like a psychopath if you were to give them praise, saying “good job” when they helped you move. Yet in a workplace, such a thing is commonplace. Adler suggests that we should seek only horizontal relationships, in which there is no condemnation or praise, merely gratitude. This even extends to a parent-child relationship, which gets interesting.</p>\n\n<p>A horizontal relationship is achieved, the book says, by focusing only on our own tasks, and leaving others to theirs. If you’re not the one who would receive the results of a task, it’s not yours to worry about. We don’t expect a parent to do their kid’s homework, so why do we then blame a parent for not intervening when a child is getting into drugs or dropping out of school? We all see the reasons for the former: children need to learn responsibility, and would fall behind in their studies or continue to rely on their parents to do what is ultimately their own task. It’s when the consequences are more dire that we lose sight of this. Conversely, a parent who does intervene in a child’s life is often done with the message that “it’s for your own good”. The book claims this is a lie, and that the parents are really just trying to fulfill their own goals… which is to be accepted in the eyes of the community, or to impose those ideals onto their children. It all comes back to the observation that we are choosing to live up to the standards of others. We should instead recognize our freedom to measure our own lives and find our own happiness<sup id=\"fnref:3\" role=\"doc-noteref\"><a href=\"#fn:3\" class=\"footnote\">3</a></sup>, and, crucially, to grant others that same freedom.</p>\n\n<p>This all pretty much blew my mind. The instinct to seek recognition and praise from others feels completely natural, and receiving it perfectly healthy and desirable, but this was very clearly showing that not to be true. The harder thing for me, though, was reading about the other half: that inserting myself in other people’s tasks was not only an invalidation of their freedom, but a selfish maneuver as well. I’ve definitely struggled in the past for feeling a deep responsibility for the misfortunes of some of the people I’m closest to in life, and then trying to fix things for them. Why should they suffer when I know that I can jump in and help them? To be sure, there is nothing wrong with feeling concern for others offering help. We are meant to guide others to water, but it is still their responsibility to drink. People need to feel autonomy in their own lives<sup id=\"fnref:4\" role=\"doc-noteref\"><a href=\"#fn:4\" class=\"footnote\">4</a></sup>, not that things are out of their control. If we grab the controls away from other people, we are robbing them the chance of finding to their own happiness.</p>\n\n<h2 id=\"the-cost-of-freedom-is-the-courage-to-be-disliked\">The cost of freedom is the courage to be disliked</h2>\n\n<p>Freedom. Finding your own happiness. Sounds great and all. Um, quick question, how though?</p>\n\n<p>The book eventually gets around to defining happiness as “the feeling of contribution”. When one has realized that they are in control of their own lives, and have found a community of comrades<sup id=\"fnref:5\" role=\"doc-noteref\"><a href=\"#fn:5\" class=\"footnote\">5</a></sup> rather than competitors, they can achieve this feeling by seeing that they are of use to others. If we can break out of the habit of self-centeredness, it will shift naturally to concern for others. “But wait! I thought this whole thing was saying to be concerned with my own problems!” Indeed! Here’s how he somersaults through that one: the problems that you’re probably thinking about are still all self-centered. Our life struggle should in fact be to find our places in our various communities, and be of use to others. It’s not about making a certain amount of money, or being liked by other people, or feeling like a super special flower that’s worthy of praise. It’s about knowing that your life has meaning, and only you can measure that. When you feel like you’ve contributed to the lives of others or the environment around you, you don’t feel the need for recognition nor the fear of dislike. You just feel happy.</p>\n\n<p>So all of this builds up to the title of the book, which was never stated much less explained until quite a ways into the book. “Adlerian psychology is about courage”, the wise old man says, days into his conversation with the fictional young man who’s doomed to be convinced.</p>\n\n<p>The courage to be happy: it’s on us to face the world as it is. It’s truly, deeply scary to realize that we’re in charge of the one life we get to live. We cannot use our past, our relationships, or our environment as an excuse for why things can’t change. What you’re born with is out of your control, but everything after that is your dance to dance. So find your place on the dance floor, and have a little fun with it.</p>\n\n<p>The courage to be disliked: it’s on us to accept that we can’t control what other people do or what they think about us. It’s truly, deeply scary to risk displeasing people that support us. We must put our confidence in others to exercise their own freedom, and in so doing we achieve freedom ourselves.</p>\n\n<p>The courage to be normal: it’s on us to just be us. It’s truly, deeply scary to face the idea that this may be our last day. Life cannot be something we live en route to some idealized destination that will give us fulfillment. Self-acceptance means loving every moment of your life. When we find our place in our communities and are of use to those around us, it becomes clear that we have existential worth. All we have to be is ourselves, and we will already fulfilled our purpose in life.</p>\n\n<p>Life is a dance to be lived in here and now. This metaphor is hammered home in the last chapters of the book, and as a definitive Bad Dancer it really brought some of that visceral fear of making a fool out of myself in front of everyone. Of not knowing what I was doing, of being exposed as a fraud or a fool. So, even in that, I profoundly agree with the book that life is about finding courage. The courage to dance as if no one is watching.</p>\n\n<div class=\"footnotes\" role=\"doc-endnotes\">\n  <ol>\n    <li id=\"fn:1\" role=\"doc-endnote\">\n      <p>Until last year, I believed I was on the autism spectrum due to some really screwed up diagnoses as a child. Imagine how that would shape your life! <a href=\"#fnref:1\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:2\" role=\"doc-endnote\">\n      <p>From a philosophical perspective, yes, technically all we can know is that we exist. I think therefore I am, all that stuff. I’m pretty sold on the whole science thing though, and the idea that the world we seem to be observing is some interpretation of an objective reality that is shared by other beings that also have that whole consciousness thing going on. We can explain the behavior of biological creatures though layers of scientific knowledge based on evolutionary biology, and that’s the framework I’m going with for now. Maybe I’m just scared of change? <a href=\"#fnref:2\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:3\" role=\"doc-endnote\">\n      <p>Okay so what, we should just be selfish and only worry about ourselves, and ignore the suffering all around us as long as we are happy? That would be quite the hot take, and is where my skepticism took me on my first read as well. Suffice it to say no, that’s not at all where this is going. <a href=\"#fnref:3\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:4\" role=\"doc-endnote\">\n      <p>An ex tried to teach me this once. She was a social worker, and had long ago learned the lessons of the appropriate ways to help other people. Ultimately our relationship ended, in part, because I hadn’t figured this out for myself yet. Reading this book brought a lot of wisdom that I wish I’d had then, but I also doubt that without those experiences I could have internalized it quite as well. <a href=\"#fnref:4\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:5\" role=\"doc-endnote\">\n      <p>Yeah so the whole communist thing is probably a real influence on all this. Haven’t actually checked on this myself, and I don’t really want to, for fear of irrevocably tying it to the muddy waters of politics. The themes of rejection of the hierarchy certainly ring true of Marxism. On the other hand the book is still quite individualistic, saying we should not take responsibility for fixing the lives of others, which is like, not very socialist? <a href=\"#fnref:5\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n  </ol>\n</div>\n",
            "url": "https://drum.zone/book/2021/01/24/the-courage-to-be-disliked/",
            "date_published": "2021-01-24T00:00:00+00:00",
            "date_modified": "2021-01-24T00:00:00+00:00",
            "author": {
                "name": ""
            }
        },
        
    
      
        
        
        {
            "id": "https://drum.zone/personal/2021/01/02/year-of-intention/",
            "title": "The Year of Intention",
            "content_text": "Every year since last year I set a theme for myself. It’s a way to harness the typical New Year’s Resolution energy into something that is actually likely to help me out, rather than depress me after I fail in two weeks. A theme is there to help inform my everyday decisions, and reflect upon my broader trends, to slowly nudge myself in a direction I find important, rather than a simple pass-fail goal like meditating every day or losing 20lbs. It can even adapt to new circumstances, which, you know… is relevant.\n\nLast year was my Year of Focus. I pointedly found myself rather unfocused going into 2020, and early on found actually myself pulled into even more directions than I ever had before. All at once I was working two jobs, editing and contributing to a book, building a gym habit, and beginning a new relationship. All that spilled into, wouldn’t you know it, the pandemic. Burnout ensued, and combined with the complete destabilization of my routine, resulted in a mental health crash and severe contraction into my own little depressed bubble.\n\nHowever, I ended up having some of the best personal development of my life last year. My typical coping mechanism of paying-other-people-to-talk-to-me actually paid off, in the form of a fantastic new therapist and some psychiatric assistance. This helped me actually find things to focus on, realize my values, and build a framework for actually achieving that focus. I took a “mental health month” in October that almost immediately resulted in a clarity I hadn’t felt all year. With all the shit that came out of the year, it has also helped me realize what is important, and given me a set of tools to actually focus and achieve my goals.\n\nAll that said, looking at 2021, focus is still something that I wanted to work on. I still think that I am too susceptible to instant gratification, and when I’m in that mode I don’t even recognize myself in my behaviors or thoughts. One phrase I ended up finding and obsessing over last year was “living with intention”; to spend my time doing what I actually want to do, rather than get sucked into things that are pleasurable but not satisfying. So that’s my new theme: The Year of Intention.\n\nIt’s a subtle difference from last year, and I’m still discovering the meaning in it. More practically, my immediate goals with this are to start spending my time on things that I enjoy in a broader satisfying sense, rather than giving into the everyday cravings for junk, be it in the form of food (fast), information (Twitter/News), approval (Instagram/Dating apps), or distraction (video games). I don’t intend to cut those things out of my life entirely, as there are parts in each that I genuinely find benefit and fulfillment in, but those too easily engage the parts of my dumb brain and turn me into a drone rather than a pilot.\n\nWhat are my new intentions? Well, of course, here I’m still pretty basic.\n\n  Better information - More books, less daily news cycle. I have found that there’s a big difference in terms of quality/value, and even just in how my brain reacts to things, the longer it takes to make it. Podcasts, YouTube videos, and Twitter feeds are pretty information dense, but wisdom light. There are lots of exceptions though, and those are the things I’ll try to keep distilling down to. I’ll stay engaged with the happenings of the world, but probably with minimal commentary, as that’s where it really just becomes pollution for my brain.\n  Better entertainment - More movies, less video games. I currently have a love/hate relationship with Hearthstone, in that I find it a genuinely well-designed and satisfying game most of the time, but it’s also a forever game - something that I could literally play for the rest of my life and ultimately accomplish nothing. On the flipside, I’ve actually realized how much more I benefit from watching movies and TV shows, especially those that I have been recommended by my favorite internet friends (read: podcast hosts and Twitter personalities). I am not super susceptible to mindless Netflix binge fests or rewatching the same show repeatedly, so this is actually something I feel like I can incorporate into my life. I usually learn something, and it’s actually a completable task.\n  Better eating - My health has certainly improved in the last five years more than I ever would have dreamed, but I still recognize the habits of a 400lb guy in me every now and then. I ate with intention for a year and a half and lost a ton of weight, but eventually it stopped being the main focus of my life and I started relying on shortcuts, and making food I didn’t actually like but was easy. Eventually I fully incorporated “cheat meals”, then “cheat days”, then “cheat weekends” into my routine, and have completely stalled in achieving my eventual goal weight. I lost my good relationship with food, and I’d like to win her back. It’s no longer a numerical weight thing for me though; I just need to eat with intention, with mindfulness, and with joy, rather than constantly snack, drive to drive-throughs (!), or cook the same three bland-but-easy things forever.\n\n\nAll of this is in service to, and dependent on, mindfulness. Modern life, with its eradication of boredom and abundance of pleasures, is fundamentally incongruent with a happy fulfilling life. We’ve optimized for our base needs so much that we become addicted to information, entertainment, and eating. Addiction is by definition a lack of control, and I’ve recognized that in myself more the past year than ever before. I believe that being mindful and intentional with more of my life will ultimately help me wrest control back from my monkey brain, as often as I can, and free me to chase my values.\n",
            "content_html": "<p>Every year since last year I set a theme for myself. It’s a way to harness the typical New Year’s Resolution energy into something that is actually likely to help me out, rather than depress me after I fail in two weeks. A theme is there to help inform my everyday decisions, and reflect upon my broader trends, to slowly nudge myself in a direction I find important, rather than a simple pass-fail goal like meditating every day or losing 20lbs. It can even adapt to new circumstances, which, you know… is relevant.</p>\n\n<p>Last year was my Year of Focus. I pointedly found myself rather unfocused going into 2020, and early on found actually myself pulled into even more directions than I ever had before. All at once I was working two jobs, editing and contributing to a book, building a gym habit, and beginning a new relationship. All that spilled into, wouldn’t you know it, <em>the pandemic</em>. Burnout ensued, and combined with the complete destabilization of my routine, resulted in a mental health crash and severe contraction into my own little depressed bubble.</p>\n\n<p>However, I ended up having some of the best personal development of my life last year. My typical coping mechanism of paying-other-people-to-talk-to-me actually paid off, in the form of a fantastic new therapist and some psychiatric assistance. This helped me actually find things to focus on, realize my values, and build a framework for actually achieving that focus. I took a “mental health month” in October that almost immediately resulted in a clarity I hadn’t felt all year. With all the shit that came out of the year, it has also helped me realize what is important, and given me a set of tools to actually focus and achieve my goals.</p>\n\n<p>All that said, looking at 2021, focus is still something that I wanted to work on. I still think that I am too susceptible to instant gratification, and when I’m in that mode I don’t even recognize myself in my behaviors or thoughts. One phrase I ended up finding and obsessing over last year was “living with intention”; to spend my time doing what I actually want to do, rather than get sucked into things that are pleasurable but not satisfying. So that’s my new theme: <strong>The Year of Intention</strong>.</p>\n\n<p>It’s a subtle difference from last year, and I’m still discovering the meaning in it. More practically, my immediate goals with this are to start spending my time on things that I enjoy in a broader satisfying sense, rather than giving into the everyday cravings for junk, be it in the form of food (fast), information (Twitter/News), approval (Instagram/Dating apps), or distraction (video games). I don’t intend to cut those things out of my life entirely, as there are parts in each that I genuinely find benefit and fulfillment in, but those too easily engage the parts of my dumb brain and turn me into a drone rather than a pilot.</p>\n\n<p>What are my new <em>intentions</em>? Well, of course, here I’m still pretty basic.</p>\n<ul>\n  <li><strong>Better information</strong> - More books, less daily news cycle. I have found that there’s a big difference in terms of quality/value, and even just in how my brain reacts to things, the longer it takes to make it. Podcasts, YouTube videos, and Twitter feeds are pretty information dense, but wisdom light. There are <a href=\"https://podcasts.apple.com/us/podcast/what-trump-can-teach-us-about-con-law/id1242537529\">lots</a> <a href=\"https://www.youtube.com/watch?v=NVGuFdX5guE\">of</a> <a href=\"https://twitter.com/naval/status/1002103360646823936\">exceptions</a> though, and those are the things I’ll try to keep distilling down to. I’ll stay engaged with the happenings of the world, but probably with minimal commentary, as that’s where it really just becomes pollution for my brain.</li>\n  <li><strong>Better entertainment</strong> - More movies, less video games. I currently have a love/hate relationship with <a href=\"https://playhearthstone.com/\">Hearthstone</a>, in that I find it a genuinely well-designed and satisfying game most of the time, but it’s also a <em>forever game</em> - something that I could literally play for the rest of my life and ultimately accomplish nothing. On the flipside, I’ve actually realized how much more I benefit from watching movies and TV shows, especially those that I have been recommended by my favorite internet friends (read: podcast hosts and Twitter personalities). I am not super susceptible to mindless Netflix binge fests or rewatching the same show repeatedly, so this is actually something I feel like I can incorporate into my life. I usually learn something, and it’s actually a completable task.</li>\n  <li><strong>Better eating</strong> - My health has certainly improved in the last five years more than I ever would have dreamed, but I still recognize the habits of a 400lb guy in me every now and then. I ate with intention for a year and a half and lost a ton of weight, but eventually it stopped being the main focus of my life and I started relying on shortcuts, and making food I didn’t actually like but was easy. Eventually I fully incorporated “cheat meals”, then “cheat days”, then “cheat weekends” into my routine, and have completely stalled in achieving my eventual goal weight. I lost my good relationship with food, and I’d like to win her back. It’s no longer a numerical weight thing for me though; I just need to eat with intention, with mindfulness, and with joy, rather than constantly snack, drive to drive-throughs (!), or cook the same three bland-but-easy things forever.</li>\n</ul>\n\n<p>All of this is in service to, and dependent on, mindfulness. Modern life, with its eradication of boredom and abundance of pleasures, is fundamentally incongruent with a happy fulfilling life. We’ve optimized for our base needs so much that we become addicted to information, entertainment, and eating. Addiction is by definition a lack of control, and I’ve recognized that in myself more the past year than ever before. I believe that being mindful and intentional with more of my life will ultimately help me wrest control back from my monkey brain, as often as I can, and free me to chase my values.</p>\n",
            "url": "https://drum.zone/personal/2021/01/02/year-of-intention/",
            "date_published": "2021-01-02T00:00:00+00:00",
            "date_modified": "2021-01-02T00:00:00+00:00",
            "author": {
                "name": ""
            }
        },
        
    
      
        
        
        {
            "id": "https://drum.zone/politics/personal/2020/06/07/welcome-to-this/",
            "title": "Welcome to this!",
            "content_text": "What is this? I don’t know yet.\n\nI am here to learn. I think one of the best ways to learn is to form thoughts into words.\n\nI recently helped write a book1, and it helped me solidify many thoughts I had on the roles technology and media have played on political polarization. The actual process of turning weird brain goop into structured, linear thoughts presented to a random other person is a crazy undertaking. Nothing can test your own opinions like the need to actually force them to make sense to someone without any of the same brain goop you’ve got. Many times, some thought I had didn’t hold up to the scrutiny of paper, much less a skeptical reader. Other times, dots began to connect that I didn’t even realize were there before.\n\nThere’s some insane shit going on in the world right now2, and it’s too much for anyone to process. I want to try though.\n\nI didn’t care for politics much until well into adulthood. Turns out it matters though, oops. When it did come time to hold discussions with people who had thought much more about things than I did, I only stood to infuriate them. I held many beliefs that I’d taken for granted, and spouted out things I’d heard before that sounded right, but I really hadn’t scrutinized them much at all for myself. People much smarter than me had already heard all these things before, and helped me to see both the impact and importance of getting things right, but also the complexity in doing so.\n\nNow, I do a lot of thinking and not a lot of deciding. I’m annoyingly politically moderate. I listen to perspectives on both sides, trying to combine them in some intricate web of the theory of the world. My motivation for the last four years has been to understand why people think they way they do. My default reaction to almost anyone is to ask why they believe it, and what could have led them astray in that process. I’ve learned a lot about myself and others in this process, but it doesn’t actually make the world a better place.\n\nI’m here to toy with ideas, for sure. But in doing so I hope to come to conclusions. I’m gonna get stuff wrong, anyway. I strive to improve my thinking, to change my mind, to be called a hypocrite by people who think that people are static. Let this be a place to document that.\n\nI don’t expect this blog to be all about politics though. Might be well after 2020 that I can start nerding out about technology and space and psychology and history and antitrust and Star Wars… but don’t you worry I’m still here for that trash.\n\n\n  \n    \n      Peace Talks: The Good News of Jesus in a Donkey-Elephant War. The book topic was not mine, but I contributed a chapter to it about the role modern times have played on political polarization. The book is otherwise written by my father Dave Drum who is a pastor, and I hitched a ride on his writing career when for the first time I felt our passions about the world aligned. It was a very rewarding experience, but I requested that my writing credit remain minimal because of some of the more religious-based arguments in there. Some parts will hold up better than others, but specifically the book makes strong arguments against gay marriage and abortion, which I certainly do not share. &#8617;\n    \n    \n      June 7 2020: The global COVID-19 pandemic has recently lost the spotlight to the global protests highlighting police brutality and Black Lives Matter following the murder of George Floyd and others. It’s the height of my hubris that I actually believe that this footnote will actually be revealing to almost anyone reading this in the future, and that I’ll be writing for years to come. But also, with the rate the news cycle moves these days, I truly cannot predict what people will even be thinking about next week. &#8617;\n    \n  \n\n",
            "content_html": "<p>What is this? I don’t know yet.</p>\n\n<p>I am here to learn. I think one of the best ways to learn is to form thoughts into words.</p>\n\n<p>I recently helped <a href=\"https://j17ministries.org/store/peace-talks-the-good-news-of-jesus-in-a-donkey-elephant-war\">write a book</a><sup id=\"fnref:1\" role=\"doc-noteref\"><a href=\"#fn:1\" class=\"footnote\">1</a></sup>, and it helped me solidify many thoughts I had on the roles technology and media have played on political polarization. The actual process of turning weird brain goop into structured, linear thoughts presented to a random other person is a crazy undertaking. Nothing can test your own opinions like the need to actually force them to make sense to someone without any of the same brain goop you’ve got. Many times, some thought I had didn’t hold up to the scrutiny of paper, much less a skeptical reader. Other times, dots began to connect that I didn’t even realize were there before.</p>\n\n<p>There’s some insane shit going on in the world right now<sup id=\"fnref:2\" role=\"doc-noteref\"><a href=\"#fn:2\" class=\"footnote\">2</a></sup>, and it’s too much for anyone to process. I want to try though.</p>\n\n<p>I didn’t care for politics much until well into adulthood. Turns out it matters though, oops. When it did come time to hold discussions with people who had thought much more about things than I did, I only stood to infuriate them. I held many beliefs that I’d taken for granted, and spouted out things I’d heard before that sounded right, but I really hadn’t scrutinized them much at all for myself. People much smarter than me had already heard all these things before, and helped me to see both the impact and importance of getting things right, but also the complexity in doing so.</p>\n\n<p>Now, I do a lot of thinking and not a lot of deciding. I’m annoyingly politically moderate. I listen to perspectives on both sides, trying to combine them in some intricate web of the theory of the world. My motivation for the last four years has been to understand why people think they way they do. My default reaction to almost anyone is to ask why they believe it, and what could have led them astray in that process. I’ve learned a lot about myself and others in this process, but it doesn’t actually make the world a better place.</p>\n\n<p>I’m here to toy with ideas, for sure. But in doing so I hope to come to conclusions. I’m gonna get stuff wrong, anyway. I strive to improve my thinking, to change my mind, to be called a hypocrite by people who think that people are static. Let this be a place to document that.</p>\n\n<p>I don’t expect this blog to be all about politics though. Might be well after 2020 that I can start nerding out about technology and space and psychology and history and antitrust and Star Wars… but don’t you worry I’m still here for that trash.</p>\n\n<div class=\"footnotes\" role=\"doc-endnotes\">\n  <ol>\n    <li id=\"fn:1\" role=\"doc-endnote\">\n      <p><strong>Peace Talks: The Good News of Jesus in a Donkey-Elephant War</strong>. The book topic was not mine, but I contributed a chapter to it about the role modern times have played on political polarization. The book is otherwise written by my father Dave Drum who is a pastor, and I hitched a ride on his writing career when for the first time I felt our passions about the world aligned. It was a very rewarding experience, but I requested that my writing credit remain minimal because of some of the more religious-based arguments in there. Some parts will hold up better than others, but specifically the book makes strong arguments against gay marriage and abortion, which I certainly do not share. <a href=\"#fnref:1\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:2\" role=\"doc-endnote\">\n      <p>June 7 2020: The global COVID-19 pandemic has recently lost the spotlight to the global protests highlighting police brutality and Black Lives Matter following the murder of George Floyd and others. It’s the height of my hubris that I actually believe that this footnote will actually be revealing to almost anyone reading this in the future, and that I’ll be writing for years to come. But also, with the rate the news cycle moves these days, I truly cannot predict what people will even be thinking about next week. <a href=\"#fnref:2\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n  </ol>\n</div>\n",
            "url": "https://drum.zone/politics/personal/2020/06/07/welcome-to-this/",
            "date_published": "2020-06-07T14:18:57+00:00",
            "date_modified": "2020-06-07T14:18:57+00:00",
            "author": {
                "name": ""
            }
        }
        
    
    ]
}